; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=75, out_folder=htg/blocksworld/training, instance_id=55, seed=2079, goal_proportion=0.1

(define (problem blocksworld-55)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 - object)
 (:init 
    (arm-empty)
    (clear b16)
    (on b16 b6)
    (on b6 b4)
    (on b4 b62)
    (on b62 b47)
    (on b47 b43)
    (on b43 b72)
    (on b72 b68)
    (on-table b68)
    (clear b63)
    (on b63 b5)
    (on b5 b40)
    (on b40 b21)
    (on-table b21)
    (clear b64)
    (on b64 b1)
    (on-table b1)
    (clear b34)
    (on-table b34)
    (clear b35)
    (on b35 b74)
    (on-table b74)
    (clear b3)
    (on b3 b8)
    (on b8 b49)
    (on b49 b20)
    (on b20 b56)
    (on b56 b33)
    (on b33 b58)
    (on b58 b38)
    (on b38 b17)
    (on-table b17)
    (clear b55)
    (on b55 b18)
    (on-table b18)
    (clear b36)
    (on b36 b67)
    (on b67 b53)
    (on b53 b41)
    (on-table b41)
    (clear b45)
    (on b45 b31)
    (on b31 b70)
    (on-table b70)
    (clear b65)
    (on b65 b46)
    (on b46 b24)
    (on-table b24)
    (clear b61)
    (on b61 b29)
    (on b29 b66)
    (on b66 b48)
    (on b48 b27)
    (on-table b27)
    (clear b13)
    (on b13 b12)
    (on-table b12)
    (clear b57)
    (on b57 b9)
    (on-table b9)
    (clear b71)
    (on-table b71)
    (clear b22)
    (on-table b22)
    (clear b19)
    (on b19 b39)
    (on b39 b69)
    (on-table b69)
    (clear b54)
    (on b54 b44)
    (on b44 b37)
    (on b37 b60)
    (on b60 b15)
    (on-table b15)
    (clear b14)
    (on-table b14)
    (clear b75)
    (on b75 b11)
    (on b11 b51)
    (on b51 b28)
    (on-table b28)
    (clear b50)
    (on-table b50)
    (clear b7)
    (on b7 b42)
    (on-table b42)
    (clear b10)
    (on b10 b73)
    (on b73 b2)
    (on b2 b30)
    (on b30 b32)
    (on b32 b52)
    (on-table b52)
    (clear b23)
    (on b23 b25)
    (on-table b25)
    (clear b26)
    (on b26 b59)
    (on-table b59))
 (:goal  (and 
    (clear b6)
    (on b6 b5)
    (on b5 b2)
    (on b2 b4)
    (on b4 b3)
    (on-table b3)
    (clear b1)
    (on b1 b7)
    (on-table b7))))

; plan
1. (unstack b7 b42)
   deleted: (on b7 b42) (clear b7) (arm-empty)
   added: (holding b7) (clear b42)
   goals met: 0 of 9
2. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 1 of 9
3. (unstack b3 b8)
   deleted: (on b3 b8) (clear b3) (arm-empty)
   added: (holding b3) (clear b8)
   goals met: 1 of 9
4. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 2 of 9
5. (unstack b63 b5)
   deleted: (on b63 b5) (clear b63) (arm-empty)
   added: (holding b63) (clear b5)
   goals met: 2 of 9
6. (putdown b63)
   deleted: (holding b63)
   added: (clear b63) (arm-empty) (on-table b63)
   goals met: 2 of 9
7. (unstack b10 b73)
   deleted: (on b10 b73) (clear b10) (arm-empty)
   added: (holding b10) (clear b73)
   goals met: 2 of 9
8. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 2 of 9
9. (unstack b16 b6)
   deleted: (on b16 b6) (clear b16) (arm-empty)
   added: (holding b16) (clear b6)
   goals met: 3 of 9
10. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 3 of 9
11. (unstack b64 b1)
   deleted: (on b64 b1) (clear b64) (arm-empty)
   added: (holding b64) (clear b1)
   goals met: 4 of 9
12. (putdown b64)
   deleted: (holding b64)
   added: (clear b64) (arm-empty) (on-table b64)
   goals met: 4 of 9
13. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 3 of 9
14. (stack b1 b7)
   deleted: (clear b7) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b7)
   goals met: 5 of 9
15. (unstack b6 b4)
   deleted: (on b6 b4) (clear b6) (arm-empty)
   added: (holding b6) (clear b4)
   goals met: 4 of 9
16. (stack b6 b5)
   deleted: (clear b5) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b5)
   goals met: 6 of 9
17. (unstack b4 b62)
   deleted: (on b4 b62) (clear b4) (arm-empty)
   added: (holding b4) (clear b62)
   goals met: 6 of 9
18. (stack b4 b3)
   deleted: (clear b3) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b3)
   goals met: 7 of 9
19. (unstack b73 b2)
   deleted: (on b73 b2) (clear b73) (arm-empty)
   added: (holding b73) (clear b2)
   goals met: 7 of 9
20. (putdown b73)
   deleted: (holding b73)
   added: (clear b73) (arm-empty) (on-table b73)
   goals met: 7 of 9
21. (unstack b2 b30)
   deleted: (on b2 b30) (clear b2) (arm-empty)
   added: (holding b2) (clear b30)
   goals met: 7 of 9
22. (stack b2 b4)
   deleted: (clear b4) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b4)
   goals met: 8 of 9
23. (unstack b6 b5)
   deleted: (on b6 b5) (clear b6) (arm-empty)
   added: (holding b6) (clear b5)
   goals met: 6 of 9
24. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 7 of 9
25. (unstack b5 b40)
   deleted: (on b5 b40) (clear b5) (arm-empty)
   added: (holding b5) (clear b40)
   goals met: 7 of 9
26. (stack b5 b2)
   deleted: (clear b2) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b2)
   goals met: 8 of 9
27. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 7 of 9
28. (stack b6 b5)
   deleted: (clear b5) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b5)
   goals met: 9 of 9
